import React from 'react'

const ChallengeSearch = () => {
  return (
    <div>ChallengeSearch
        {/* 챌린지 탐색하기
        챌린지 검색하기(운동명으로 ) 검색 버튼 시 관련한 챌린지 보여주기
        기본 챌린지 영역
        SPOFIT에서 제공하는 챌린지(챌린지 제목, 챌린지 미리보기, 달력과 함께 보여주기)
        양 옆으로 버튼 만들어 개수가 넘을 경우 넘어가게 하기
        하트 클릭시 마이페이지 찜 목록
        챌린지 클릭시 진행중 챌린지 or 챌린지 보관함
        
        공유 챌린지 영역
        다른 사용자들이 공유한 챌린지 보여주기
        챌린지 제목, 내용, 달력 보여주기
        양 옆에 버튼으로 넘어가고 새로운 챌린지가 보이게 하기
        하트 클릭 시 추천수 올라가게 하기
        조회수 보이게 하기
        챌린지 클릭 시 진행중 챌린지 or 챌린지 보관함


        */}
    </div>
  )
}

export default ChallengeSearch